#include "GameInfo.h"

void GameInfo::displayGameInfo() {
    std::cout << "-------------------------------------------------------------------------" << std::endl;
    std::cout << "Добро пожаловать в игру пятнашки!" << std::endl;
    std::cout << "Пятнашки - это головоломка, где нужно упорядочить числа от 1 до 15 " << std::endl;
    std::cout << "в порядке возрастания, так чтобы последняя 16-ая клетка была постой " << std::endl;
    std::cout << "-------------------------------------------------------------------------" << std::endl;
   
}